rheoTool/tutorials/rheoBDFoam/flowFocusing/electrophoresis/electricFieldSimulation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    phiE
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.;
        smoother        DIC;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 80;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }
    
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.01;
        smoother        DIC;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 80;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }

    U
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-10;
        relTol            0.001;
        minIter           0;
        maxIter           1000;
    }
 
}

electricControls
{
  phiEEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
}

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
       
    }
}

relaxationFactors
{
    fields
     {        
	p 	1;
     }

    equations
     { 
       U 	1;
     }
}

// ************************************************************************* //
